import Mock from 'mockjs';

// 人员列表
Mock.mock('/v1.0/xxnyjyzt/getXxjyztList', 'post', {
  code: 0,
  message: '操作成功',
  data: [
    {
      objectid: 5,
      cbfmc: '陈亚亚',

      cbfzjhm: '1232131213',
      cbfdz: '123',
    },
  ],
});

// 行政区域
Mock.mock('/v1.0/region/getRegion', 'post', {
  code: 0,
  message: '操作成功',
  data: [
    {
      value: '341282',
      label: '界首市',
      fullName: '界首市',
      children: [
        {
          value: '341282102',
          label: '芦村镇',
          fullName: '芦村镇',
          children: [],
        },
        {
          value: '341282002',
          label: '西城街道',
          fullName: '西城街道',
          children: [],
        },
      ],
    },
  ],
});

// 空间统计
Mock.mock('/v1.0/statistic/getStatistic', 'post', {
  code: 0,
  message: '操作成功',
  data: {
    region: '界首市',
    regionCode: '430381202',
    area: 200.11,
    label: '承保地块',
    childList: [
      {
        region: '永乐镇',

        regionCode: '430381202',
        area: 80.11,
        childList: [],
      },
      {
        region: '芦村镇',

        regionCode: '430381203',
        area: 120,
        childList: [],
      },
    ],
  },
});

Mock.mock('/v1.0/xxnyjyzt/getXxjyztList', 'post', {
  code: 0,
  message: '操作成功',
  data: [
    {
      fzr: '陈亚亚',
      id: 5,

      zjhm: '1232131213',
    },
  ],
});
Mock.mock('/v1.0/xxnyjyzt/getXxjyztListDetail', 'post', {
  code: 0,
  message: '操作成功',
  data: {
    dkArea: 133.734492622,
    dkNum: 108,
    fzr: '陈亚亚',
    id: 5,
    tgmj: 0,
    zjhm: '1232131213',
    dkSpatials: {
      features: [
        {
          geometry: {
            coordinates: [
              [
                [
                  [115.335268745, 33.117418782],
                  [115.335267227, 33.117381923],
                  [115.333729183, 33.117272451],
                  [115.333724974, 33.117310634],
                  [115.335268745, 33.117418782],
                ],
              ],
            ],
            type: 'MultiPolygon',
          },
          id: '85349',
          type: 'Feature',
          properties: {
            dkbm: '3412821072110700067',
            dkmc: '庄北地',
            dkmj: 0.9,
            lzxglx: '',
            mj: 0,
            ygcl: '',
            zwzs: '',
            zzjgName: '',
            zzzw: '小麦',
          },
        },
        {
          geometry: {
            coordinates: [
              [
                [
                  [115.333844325, 33.11534022],
                  [115.331415152, 33.114950197],
                  [115.331405673, 33.114978991],
                  [115.333835306, 33.11536837],
                  [115.333844325, 33.11534022],
                ],
              ],
            ],
            type: 'MultiPolygon',
          },
          id: '85990',
          properties: {
            dkmc: '西地',
            dkbm: '3412821072110600144',
            dkmj: 1.13,
            zzzw: '小麦',
            mj: 0,
            zwzs: '',
            ygcl: '',
          },
          type: 'Feature',
        },
      ],
    },
  },
});

// 人员搜索列表
// Mock.mock('/v1.0/xxnyjyzt/getXxjyztListDetail', 'post', {
//   code: 0,
//   message: '操作成功',
//   data: {
//     dkArea: 133.734492622,
//     dkNum: 108,
//     cbfmc: '陈亚亚',
//     zw: '水稻',
//     id: 5,
//     zwArea: 0,
//     cbfzjhm: '1232131213',
//     dkFenceGeoJsonBeans: [
//       {
//         features: [
//           {
//             geometry: {
//               coordinates: [
//                 [
//                   [
//                     [115.335268745, 33.117418782],
//                     [115.335267227, 33.117381923],
//                     [115.333729183, 33.117272451],
//                     [115.333724974, 33.117310634],
//                     [115.335268745, 33.117418782],
//                   ],
//                 ],
//               ],
//               type: 'MultiPolygon',
//             },
//             id: '85349',
//             type: 'Feature',
//             properties: {
//               dkbm: '3412821072110700067',
//               dkmc: '庄北地',
//               scmjm: 0.9,
//               lzxglx: '',
//               sbmj: 0,
//               ygcl: '',
//               zwzs: '',
//               zzjgName: '',
//               zzzw: '小麦',
//             },
//           },
//         ],
//       },
//       {
//         features: [
//           {
//             geometry: {
//               coordinates: [
//                 [
//                   [
//                     [115.333844325, 33.11534022],
//                     [115.331415152, 33.114950197],
//                     [115.331405673, 33.114978991],
//                     [115.333835306, 33.11536837],
//                     [115.333844325, 33.11534022],
//                   ],
//                 ],
//               ],
//               type: 'MultiPolygon',
//             },
//             id: '85990',
//             properties: {
//               dkmc: '西地',
//               dkbm: '3412821072110600144',
//               scmjm: 1.13,
//               zzzw: '小麦',
//               sbmj: 0,
//               zwzs: '',
//               ygcl: '',
//             },
//             type: 'Feature',
//           },
//         ],
//       },
//     ],
//   },
// });

// 当前保单地块
Mock.mock('/v1.0/currentInsurance/insuranceGeojson', 'post', {
  code: 0,
  message: '操作成功',
  data: {
    type: 'FeatureCollection',
    features: [
      {
        type: 'Feature',
        properties: {
          BSM: 285852,
          YSDM: '211011',
          DKBM: '3412821062130600114',
          DKMC: '北小洼地',
          SYQXZ: '31',
          DKLB: '99',
          TDLYLX: '013',
          DLDJ: '10',
          TDYT: '1',
          SFJBNT: '2',
          DKDZ: '机耕路',
          DKXZ: '赵勇、空地等',
          DKNZ: '沟渠',
          DKBZ: '空地、机耕路',
          DKBZXX: null,
          ZJRXM: '赵寨七队九队集体土地',
          KJZB: 'S285792/S285793/S285794/S285795/S285796/S285797/S285798/S285799/S285800',
          SCMJ: 10026.09,
          SCMJM: 15.04,
          SJXZQH: '阜阳市',
          XJXZQH: '界首市',
          XZXZQH: '陶庙镇',
          CJXZQH: '赵寨行政村',
          TEAM: '赵寨自然村',
          XZQHDM: '34128210621306',
        },
        geometry: {
          type: 'MultiPolygon',
          coordinates: [
            [
              [
                [115.353887271458049, 33.202848631904075],
                [115.353192664134852, 33.202893214927165],
                [115.35320531223843, 33.203094091520491],
                [115.353206311664181, 33.203139459074919],
                [115.353397827905354, 33.203159452365576],
                [115.354612710597081, 33.203100720982036],
                [115.354586518363561, 33.201996207463893],
                [115.354110118540788, 33.202069564766894],
                [115.353846453435239, 33.202102166683325],
                [115.353887271458049, 33.202848631904075],
              ],
            ],
          ],
        },
      },
      {
        type: 'Feature',
        properties: {
          BSM: 285884,
          YSDM: '211011',
          DKBM: '3412821062130600146',
          DKMC: '北小洼地',
          SYQXZ: '31',
          DKLB: '10',
          TDLYLX: '013',
          DLDJ: '10',
          TDYT: '1',
          SFJBNT: '1',
          DKDZ: '赵寨七队九队集体土地',
          DKXZ: '空地',
          DKNZ: '乡村道路',
          DKBZ: '赵寨七队九队集体土地',
          DKBZXX: null,
          ZJRXM: '赵勇',
          KJZB: 'S285799/S285798/S285797/S287599',
          SCMJ: 5280.01,
          SCMJM: 7.92,
          SJXZQH: '阜阳市',
          XJXZQH: '界首市',
          XZXZQH: '陶庙镇',
          CJXZQH: '赵寨行政村',
          TEAM: '赵寨自然村',
          XZQHDM: '34128210621306',
        },
        geometry: {
          type: 'MultiPolygon',
          coordinates: [
            [
              [
                [115.353887271458049, 33.202848631904075],
                [115.353846453435239, 33.202102166683325],
                [115.353142738496615, 33.202189174230639],
                [115.353192664134852, 33.202893214927165],
                [115.353887271458049, 33.202848631904075],
              ],
            ],
          ],
        },
      },
      {
        type: 'Feature',
        properties: {
          BSM: 285783,
          YSDM: '211011',
          DKBM: '3412821062130600023',
          DKMC: '刘坟地',
          SYQXZ: '31',
          DKLB: '99',
          TDLYLX: '013',
          DLDJ: '10',
          TDYT: '1',
          SFJBNT: '2',
          DKDZ: '沟渠',
          DKXZ: '机耕路',
          DKNZ: '乡村道路',
          DKBZ: '赵维法、赵胜自等',
          DKBZXX: null,
          ZJRXM: '赵寨集体土地',
          KJZB: 'S314374/S314375/S314376/S314377/S314378/S314379/S314380/S314381/S314382/S314383/S314384/S314385/S314386',
          SCMJ: 112226.14,
          SCMJM: 168.34,
          SJXZQH: '阜阳市',
          XJXZQH: '界首市',
          XZXZQH: '陶庙镇',
          CJXZQH: '赵寨行政村',
          TEAM: '赵寨自然村',
          XZQHDM: '34128210621306',
        },
        geometry: {
          type: 'MultiPolygon',
          coordinates: [
            [
              [
                [115.355375208111155, 33.204469488452922],
                [115.355746529119415, 33.204428579062963],
                [115.356351522827595, 33.204361924897604],
                [115.356867867341634, 33.204305035397915],
                [115.3571205321809, 33.204277195349675],
                [115.357370501112342, 33.204249652859325],
                [115.357611460860056, 33.204223102496684],
                [115.357962823793216, 33.204184385865361],
                [115.358228054454372, 33.204155161407144],
                [115.358760341538826, 33.204096505145941],
                [115.358813044372567, 33.201356555255309],
                [115.354706655332691, 33.201931529042547],
                [115.354752924918898, 33.204531371235568],
                [115.355375208111155, 33.204469488452922],
              ],
            ],
          ],
        },
      },
    ],
  },
});

// 重复保单
Mock.mock('/v1.0/doubleInsurance/doubleinsuranceGeojson', 'post', {
  code: 0,
  message: '操作成功',
  data: {
    type: 'FeatureCollection',
    features: [
      {
        type: 'Feature',
        properties: {
          BSM: 285852,
          YSDM: '211011',
          DKBM: '3412821062130600114',
          DKMC: '北小洼地',
          SYQXZ: '31',
          DKLB: '99',
          TDLYLX: '013',
          DLDJ: '10',
          TDYT: '1',
          SFJBNT: '2',
          DKDZ: '机耕路',
          DKXZ: '赵勇、空地等',
          DKNZ: '沟渠',
          DKBZ: '空地、机耕路',
          DKBZXX: null,
          ZJRXM: '赵寨七队九队集体土地',
          KJZB: 'S285792/S285793/S285794/S285795/S285796/S285797/S285798/S285799/S285800',
          SCMJ: 10026.09,
          SCMJM: 15.04,
          SJXZQH: '阜阳市',
          XJXZQH: '界首市',
          XZXZQH: '陶庙镇',
          CJXZQH: '赵寨行政村',
          TEAM: '赵寨自然村',
          XZQHDM: '34128210621306',
        },
        geometry: {
          type: 'MultiPolygon',
          coordinates: [
            [
              [
                [115.352842990592464, 33.20234233450914],
                [115.352148383269267, 33.20238691753223],
                [115.352161031372844, 33.202587794125556],
                [115.352162030798596, 33.202633161679984],
                [115.352353547039769, 33.202653154970641],
                [115.353568429731496, 33.202594423587101],
                [115.353542237497976, 33.201489910068958],
                [115.353065837675203, 33.201563267371959],
                [115.352802172569653, 33.20159586928839],
                [115.352842990592464, 33.20234233450914],
              ],
            ],
          ],
        },
      },
      {
        type: 'Feature',
        properties: {
          BSM: 285783,
          YSDM: '211011',
          DKBM: '3412821062130600023',
          DKMC: '刘坟地',
          SYQXZ: '31',
          DKLB: '99',
          TDLYLX: '013',
          DLDJ: '10',
          TDYT: '1',
          SFJBNT: '2',
          DKDZ: '沟渠',
          DKXZ: '机耕路',
          DKNZ: '乡村道路',
          DKBZ: '赵维法、赵胜自等',
          DKBZXX: null,
          ZJRXM: '赵寨集体土地',
          KJZB: 'S314374/S314375/S314376/S314377/S314378/S314379/S314380/S314381/S314382/S314383/S314384/S314385/S314386',
          SCMJ: 112226.14,
          SCMJM: 168.34,
          SJXZQH: '阜阳市',
          XJXZQH: '界首市',
          XZXZQH: '陶庙镇',
          CJXZQH: '赵寨行政村',
          TEAM: '赵寨自然村',
          XZQHDM: '34128210621306',
        },
        geometry: {
          type: 'MultiPolygon',
          coordinates: [
            [
              [
                [115.358572996203691, 33.202958203662405],
                [115.35894431721195, 33.202917294272446],
                [115.35954931092013, 33.202850640107087],
                [115.36006565543417, 33.202793750607398],
                [115.360318320273436, 33.202765910559158],
                [115.360568289204878, 33.202738368068808],
                [115.360809248952592, 33.202711817706167],
                [115.361160611885751, 33.202673101074843],
                [115.361425842546907, 33.202643876616627],
                [115.361958129631361, 33.202585220355424],
                [115.362010832465103, 33.199845270464792],
                [115.357904443425227, 33.20042024425203],
                [115.357950713011434, 33.203020086445051],
                [115.358572996203691, 33.202958203662405],
              ],
            ],
          ],
        },
      },
    ],
  },
});
